pip install pandas

In [4]:
import pandas as pd
import numpy as np

In [2]:
# Series - 1 dim array of labeled data
pd.Series(['A', 'B', 'C'])

0    A
1    B
2    C
dtype: object

In [5]:
# Dataframe - 2 dim array of labeled data
df = pd.DataFrame({
    "Name": ["Yossi", "Anna", "Alexey"],
    "Color": ["Red", "Blue", "Yellow"], 
    "Random": [10.0, np.nan, np.nan]
})

In [6]:
df

     Name   Color  Random
0   Yossi     Red    10.0
1    Anna    Blue     NaN
2  Alexey  Yellow     NaN

In [7]:
df["Random"]

0    10.0
1     NaN
2     NaN
Name: Random, dtype: float64

In [9]:
# CSV file , Comma seprated values
df.to_csv('data.csv', index=False)

### Exercises

In [10]:
# Apples      20
# Bananas     30
# Cherries    15
# Dates       10
# dtype: int64

my_series = pd.Series([20,30,15,10], index=['Apples', 'Bananas', 'Cherries', 'Dates'])
my_series

Apples      20
Bananas     30
Cherries    15
Dates       10
dtype: int64

In [11]:
#           Quantity   Color  Price per kg
# Apples          20     Red             3
# Bananas         30  Yellow             2
# Cherries        15     Red             4
# Dates           10   Brown             5
fruit_names = ['Apples', 'Bananas', 'Cherries', 'Dates']

quantities = [20,30,15,10]
colors = ['Red', 'Yellow', 'Red', 'Brown']
prices_per_kg = [3,2,4,5]

my_df = pd.DataFrame({
    'Quantity': quantities,
    'Color': colors,
    'Price_per_kg': prices_per_kg
}, index = fruit_names)

In [12]:
my_df

          Quantity   Color  Price_per_kg
Apples          20     Red             3
Bananas         30  Yellow             2
Cherries        15     Red             4
Dates           10   Brown             5

In [15]:
my_df.loc['Apples']

Quantity         20
Color           Red
Price_per_kg      3
Name: Apples, dtype: object

In [16]:
my_df.iloc[1]

Quantity            30
Color           Yellow
Price_per_kg         2
Name: Bananas, dtype: object

In [17]:
my_df.to_csv('my_df.csv')

In [20]:
# 4 - read csv from computer with index column
df_read = pd.read_csv('my_df.csv', index_col=0)

In [21]:
df_read

          Quantity   Color  Price_per_kg
Apples          20     Red             3
Bananas         30  Yellow             2
Cherries        15     Red             4
Dates           10   Brown             5

In [25]:
df_read.loc['Dates','Color'] = np.nan

In [26]:
df_read

          Quantity   Color  Price_per_kg
Apples          20     Red             3
Bananas         30  Yellow             2
Cherries        15     Red             4
Dates           10     NaN             5

In [23]:
df_read.loc['Dates','Color']

'Brown'

In [24]:
df_read.loc['Dates']['Color']

'Brown'

In [30]:
df_read.nlargest(3, 'Price_per_kg')

          Quantity Color  Price_per_kg
Dates           10   NaN             5
Cherries        15   Red             4
Apples          20   Red             3

In [31]:
df_read['Price_per_kg']

Apples      3
Bananas     2
Cherries    4
Dates       5
Name: Price_per_kg, dtype: int64

In [32]:
df_read['Price_per_kg'] = df_read['Price_per_kg'].astype('float16')

In [33]:
df_read.nlargest(3, 'Price_per_kg')

          Quantity Color  Price_per_kg
Dates           10   NaN           5.0
Cherries        15   Red           4.0
Apples          20   Red           3.0

### Exercises

In [34]:
df_read.head(2)

         Quantity   Color  Price_per_kg
Apples         20     Red           3.0
Bananas        30  Yellow           2.0

In [35]:
df_read.tail(2)

          Quantity Color  Price_per_kg
Cherries        15   Red           4.0
Dates           10   NaN           5.0

In [36]:
df_read.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Apples to Dates
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Quantity      4 non-null      int64
 1   Color         3 non-null      object
 2   Price_per_kg  4 non-null      float16
dtypes: float16(1), int64(1), object(1)
memory usage: 276.0+ bytes

In [37]:
df_read.describe()

        Quantity  Price_per_kg
count   4.000000      4.000000
mean   18.750000      3.500000
std     8.539126      1.291016
min    10.000000      2.000000
25%    13.750000      2.750000
50%    17.500000      3.500000
75%    22.500000      4.250000
max    30.000000      5.000000

4. What is the total quantity of fruits in the store? What are the top three fruits in the store by quantity?

In [38]:
df_read['Quantity'].sum()

75

In [39]:
df_read.nlargest(3, 'Quantity')

          Quantity   Color  Price_per_kg
Bananas         30  Yellow           2.0
Apples          20     Red           3.0
Cherries        15     Red           4.0

---

5. Set the index Fruit -> use loc, iloc to get the Banana index info
- df.set_index('Fruit', inplace=True)

In [41]:
df_read.loc['Bananas']

Quantity            30
Color           Yellow
Price_per_kg       2.0
Name: Bananas, dtype: object

In [42]:
df_read.iloc[1]

Quantity            30
Color           Yellow
Price_per_kg       2.0
Name: Bananas, dtype: object

---

6. Let's suppose the store is running a sale, and all fruits are sold at 90% of their original price.

- Add a new column named Sale_Price to the DataFrame that is 90% of the original price.

- Rename the Price column to Original_Price.

- Remove the Color column from the DataFrame.

In [46]:
df_read['Sale_Price'] = df_read['Price_per_kg'] * 0.9

In [47]:
df_read

          Quantity   Color  Price_per_kg  Sale_Price
Apples          20     Red           3.0    2.699219
Bananas         30  Yellow           2.0    1.799805
Cherries        15     Red           4.0    3.599609
Dates           10     NaN           5.0    4.500000

In [48]:
df_read.rename(columns={'Price_per_kg': 'Original_Price'}, inplace=True)

In [49]:
df_read

          Quantity   Color  Original_Price  Sale_Price
Apples          20     Red             3.0    2.699219
Bananas         30  Yellow             2.0    1.799805
Cherries        15     Red             4.0    3.599609
Dates           10     NaN             5.0    4.500000

In [51]:
df_read.drop('Color', axis=1, inplace=True)

In [52]:
df_read

          Quantity  Original_Price  Sale_Price
Apples          20             3.0    2.699219
Bananas         30             2.0    1.799805
Cherries        15             4.0    3.599609
Dates           10             5.0    4.500000

---

Let's say you found that the quantity of Grapes is missing in your DataFrame.

- Add a new row for Grapes with a missing quantity. You can add this row by creating a new DataFrame with the details of Grapes and then appending it to the existing DataFrame.

To add a new row you can use the following example:

import numpy as np

new_data = pd.DataFrame({"Fruit": ["Grapes"], "Quantity": [np.nan], "Price": [3.5]})
df = pd.concat([df, new_data], ignore_index=True) # pd.concat adds a new row
- Check if there are any missing values in the Quantitycolumn.

In [68]:
df_read

          Quantity  Original_Price  Sale_Price
Apples          20             3.0    2.699219
Bananas         30             2.0    1.799805
Cherries        15             4.0    3.599609
Dates           10             5.0    4.500000

In [53]:
new_data = pd.DataFrame({"Fruit": ["Grapes"],
                         "Quantity": [np.nan],
                         "Original_Price": [3.5],
                         "Sale_Price": [3.5 * 0.9]})

In [56]:
new_data

    Fruit  Quantity  Original_Price  Sale_Price
0  Grapes       NaN             3.5        3.15

In [59]:
new_data.set_index('Fruit', inplace=True)

In [64]:
df_with_index = pd.concat([df_read, new_data])

In [66]:
df_with_index

          Quantity  Original_Price  Sale_Price
Apples        20.0             3.0    2.699219
Bananas       30.0             2.0    1.799805
Cherries      15.0             4.0    3.599609
Dates         10.0             5.0    4.500000
Grapes         NaN             3.5    3.150000

In [65]:
df_no_index = pd.concat([df_read, new_data], ignore_index=True)

In [67]:
df_no_index

   Quantity  Original_Price  Sale_Price
0      20.0             3.0    2.699219
1      30.0             2.0    1.799805
2      15.0             4.0    3.599609
3      10.0             5.0    4.500000
4       NaN             3.5    3.150000

---

Check the data type of the Quantity column using df['Quantity'].dtype. If it is not integer, convert it using astype().

In [69]:
df_read['Quantity'].dtype

dtype('int64')

In [72]:
df_read['Quantity'].astype('float16')

Apples      20
Bananas     30
Cherries    15
Dates       10
Name: Quantity, dtype: int64

---

9. Calculate the following:

- The total quantity of all fruits.

- The name and quantity of the fruit with the highest quantity.

- The name and quantity of the fruit with the lowest quantity.

- The average original price per kg of fruits.

Hint: For the second and third bullet points, consider using the idxmax() or idxmin() functions, or boolean indexing.

In [73]:
df_read['Quantity'].sum()

75

In [74]:
df_read.nlargest(1 ,'Quantity')

         Quantity  Original_Price  Sale_Price
Bananas        30             2.0    1.799805

In [77]:
df_read['Quantity'].idxmin() # returns the index of the item with lowest quantity

'Dates'

In [78]:
df_read['Quantity'].idxmax() # returns the index of the item with highest quantity

'Bananas'